---
kind: type
id: T:Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSetIterator
source: html/1164738d-a4b8-2868-492d-c34b63c94815.htm
---
# Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSetIterator

An iterator to a TemperatureRating type set.

## Syntax (C#)
```csharp
public abstract class TemperatureRatingTypeSetIterator : APIObject,
	IEnumerator
```